package com.tvgame.constant;

import javax.microedition.lcdui.Font;

/***
 * 存放设备相关的常量(屏幕的宽高|键值|字体)
 * 
 * @author xiaobai
 * 
 */
public class Const {


	
	
	
	//=======================屏幕属性=====================
 
	public static final int WIDTH = 640;

	public static final int HEIGHT = 530;

	/**
	 *  屏幕的一半,定为常量减少程序中的运算
	 */
	public static final int WIDTH_HALF = WIDTH >> 1;

	public static final int HEIGHT_HALF = HEIGHT >> 1;
	// ====================字体常量========================
	public static Font smallFont = Font.getFont(Font.FACE_SYSTEM,
			Font.STYLE_PLAIN, Font.SIZE_MEDIUM);

	public static Font bigFont = Font.getFont(Font.FACE_SYSTEM,
			Font.STYLE_BOLD, Font.SIZE_LARGE);

	public static Font font = bigFont;

	public static final int FONT_W_CH = font.charWidth('中');// 14

	public static final int FONT_W_EG = font.charWidth('A');// 9

	public static final int FONT_H = font.getHeight();//23

	public static final int FONT_H_HALF = FONT_H>>1;
	public static final String help_str = "每次将屏幕右上角刷新出来的物品放到地图里的格子中，有3个包括3个以上的的相同级别的物品连在一起即可引发合体，合体后就会变成更高一级的物品。\n游戏中，每一株草，每一棵灌木，每一只恐龙都哭着喊求合体。你要学会用各种道具来建造你的村落，建造完成后，你将获得一笔丰厚的奖励。加油吧！\n游戏中按下数字键[9]查看帮助。";//每次将屏幕右上角刷新出来的物品放到地图里的格子中，有3个包括3个以上的的相同级别的物品连在一起即可引发合体，合体后就会变成更高一级的物品。游戏中，你还可以使用炸弹炸毁当前你不想要的物品，也可以使用魔法珠来交换当前地图上的多个物品的位置。可爱的小恐龙常常喜欢在地图上漫步来干扰你，另外飞天猪会在某个阶段出现在游戏地图里，记得你只能用火把才能烧死他们。\n游戏中按下数字键9可以随时进入游戏商城。

	public static final int COMMAND_OK = 0;
	public static final int COMMAND_BACK = 1;
	
	
	/** 音效地址 */
	public static final String PIG_WAV = "/soundeffect/pig.wav";

	/** 音效地址 */
	public static final String DINOSAUR_WAV = "/soundeffect/dinosaur.wav";
	
	/**
	 * 成就信息
	 */
	public static String achi_info[][][] = {
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成灌木", "100", "128", "1", /*"还需200"*/"个灌木达到铜牌成就，奖励1个魔法珠"},
			{"合成灌木", "500", "127", "1", "个灌木达到银牌成就，奖励1个炸弹"},
			{"合成灌木", "5000", "129", "1", "个灌木达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成树木", "80", "128", "2", /*"还需200"*/"个树木达到铜牌成就，奖励1个魔法珠"},
			{"合成树木", "400", "127", "2", "个树木达到银牌成就，奖励1个炸弹"},
			{"合成树木", "4000", "129", "2", "个树木达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成草棚", "60", "128", "3", /*"还需200"*/"个草棚达到铜牌成就，奖励1个魔法珠"},
			{"合成草棚", "300", "127", "3", "个草棚达到银牌成就，奖励1个炸弹"},
			{"合成草棚", "3000", "129", "3", "个草棚达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成砖房", "50", "128", "4", /*"还需200"*/"个砖房达到铜牌成就，奖励1个魔法珠"},
			{"合成砖房", "200", "127", "4", "个砖房达到银牌成就，奖励1个炸弹"},
			{"合成砖房", "2000", "129", "4", "个砖房达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成公寓", "45", "128", "5", /*"还需200"*/"个公寓达到铜牌成就，奖励1个魔法珠"},
			{"合成公寓", "150", "127", "5", "个公寓达到银牌成就，奖励1个炸弹"},
			{"合成公寓", "1000", "129", "5", "个公寓达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成城堡", "20", "128", "6", /*"还需200"*/"个城堡达到铜牌成就，奖励1个魔法珠"},
			{"合成城堡", "60", "127", "6", "个城堡达到银牌成就，奖励1个炸弹"},
			{"合成城堡", "500", "129", "6", "个城堡达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成空中花园", "10", "128", "7", /*"还需200"*/"个空中花园达到铜牌成就，奖励1个魔法珠"},
			{"合成空中花园", "30", "127", "7", "个空中花园达到银牌成就，奖励1个炸弹"},
			{"合成空中花园", "200", "129", "7", "个空中花园达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成空中堡垒", "5", "128", "8", /*"还需200"*/"个空中堡垒达到铜牌成就，奖励1个魔法珠"},
			{"合成空中堡垒", "20", "127", "8", "个空中堡垒达到银牌成就，奖励1个炸弹"},
			{"合成空中堡垒", "100", "129", "8", "个空中堡垒达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成石头", "50", "128", "11", /*"还需200"*/"个石头达到铜牌成就，奖励1个魔法珠"},
			{"合成石头", "150", "127", "11", "个石头达到银牌成就，奖励1个炸弹"},
			{"合成石头", "800", "129", "11", "个石头达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成化石", "20", "128", "12", /*"还需200"*/"个化石达到铜牌成就，奖励1个魔法珠"},
			{"合成化石", "50", "127", "12", "个化石达到银牌成就，奖励1个炸弹"},
			{"合成化石", "300", "129", "12", "个化石达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成宝箱", "10", "128", "13", /*"还需200"*/"个宝箱达到铜牌成就，奖励1个魔法珠"},
			{"合成宝箱", "30", "127", "13", "个宝箱达到银牌成就，奖励1个炸弹"},
			{"合成宝箱", "100", "129", "13", "个宝箱达到金牌成就，奖励1个火把"},
		},
		{
			/*0-成就名称, 1-成就条件, 2-奖品id, 3-成就id, 4-描述*/
			{"合成大宝箱", "5", "128", "14", /*"还需200"*/"个大宝箱达到铜牌成就，奖励1个魔法珠"},
			{"合成大宝箱", "20", "127", "14", "个大宝箱达到银牌成就，奖励1个炸弹"},
			{"合成大宝箱", "50", "129", "14", "个大宝箱达到金牌成就，奖励1个火把"},
		},
	};
	
}
